Revit 2027 API
ParameterTypeId.SteelElemBoltTotalWeight Property
 "Total Weight"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SteelElemBoltTotalWeight { get; }
Public Shared ReadOnly Property SteelElemBoltTotalWeight As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SteelElemBoltTotalWeight {
	ForgeTypeId^ get ();
}
static member SteelElemBoltTotalWeight : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace